app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(params[:user])
     if @user.save